% X：水平直角坐标，单位为千米(km);
% Y：纵向直角坐标，单位为千米(km);
% B：纬度，单位为弧度(rad);
% L：经度，单位为弧度(rad);
% Bo：投影基准纬度，Bo =0，单位为弧度((rad);
% Lo：坐标原点的经度，Lo =0，单位为弧度(rad);
% a：地球椭球体长半轴，a=6378137.0000，单位为米(m);
% b：地球椭球体短半轴，b=6356752.3142，单位为米(m);
% e：第一偏心率；
% e’：第二偏心率。

function [X,Y]=LL3XY(B,L)
    a=6378137.0000;
    b=6356752.3142;
    e=0.00669438444204258280946884516695;
    e1=0.00673950125438707813648942896063;
    Lo =0;
    Bo =0;
    % 输入B、L
    A=tan(pi/4+B/2);
    BB=(1-e*sin(B))/(1+e*sin(B));
    C=a^2/b;
    D=sqrt(1+e1*e1*cos(Bo)*cos(Bo));

    K=C*cos(Bo)/D;
    Y=K*log(A*BB^(e/2))/1000;
    X=K*(L-Lo)/1000;
end

